ftabet1/STM32F103-EEPROM-CLI/Core/Src/eeprom.c
/**
  ******************************************************************************
  * @file    EEPROM_Emulation/src/eeprom.c 
  * @author  MCD Application Team
  * @version V3.1.0
  * @date    07/27/2009
  * @brief   This file provides all the EEPROM emulation firmware functions.
  ******************************************************************************
  */ 

/******************************************************************************
 * ������:      eeprom.c
 * �����:       Celeron (c) 2017
 * ����������:  ������� �������� EEPROM ������ �� ���������� FLASH.
 *              ������� ��������� ������: ������ ������������ �������� �� 2����� (uint16_t).
 *              ���� � ��� ����� �� "AN2594: EEPROM emulation in STM32F10x microcontrollers"
 ******************************************************************************/
 
#include "stm32f1xx_hal.h"          // ���������� HAL API
#include "eeprom.h"                 // ��������� ��������� ������� � �����



//============================================================================
// ����������� ������
//============================================================================


// Global variable used to store variable value in read sequence 
static uint16_t DataVar = 0;

//FLASH_Status FlashStatus;


//---------------------------------------------------------------------------

// ���������� ������ �������� FLASH ������, ��������� ��� ������� ����������������:
//  ������, ��� 1K=0x400 (��� ���������� �����������������) ��� 2K=0x800 (��� ����������������� ������� ��������).

// 1) ������������ � ��������� ������������������ (� ������ �� ���������������): 
//  Define the STM32F10Xxx Flash page size depending on the used STM32 device
//#if defined (STM32F10X_LD) || defined (STM32F10X_MD) || defined (STM32F10X_MD_VL) || defined (STM32F10X_LD_VL)
//  #define PAGE_SIZE  (uint16_t)0x400  /* Page size = 1KByte */
//#elif defined (STM32F10X_HD) || defined (STM32F10X_CL)
//  #define PAGE_SIZE  (uint16_t)0x800  /* Page size = 2KByte */
//#endif	

// 2) ��������� �������: 
//  Note: Page size = 2KByte (microcontroller STM32F103VE)
//#define PAGE_SIZE  (uint16_t)0x800

// 3) ������ ����� �� ���������� HAL (������ ��������� - �� ���� ������ �������� ST):
#define PAGE_SIZE  ((uint16_t)FLASH_PAGE_SIZE)


//---------------------------------------------------------------------------

// ��������� ���������� ������ ��� ����������� ������: 
//  ��������: ��� ���������������� ����� �� ������� � ����������� Linker! ������� ��������� ����� �������� ������������ ������� ��� ��������� �� ���� ���������, ���� ��������� ������� � ���� �����...
//  �������, ����� <������� �����������> ���������� ������ - ��� EEPROM ������� �������� �������� � ����� ����� FLASH ������. 
//  ������, ����� ������� ������ ����������� �������� ��� EEPROM - ������� � ���������� Project\Linker(Target) ���������� �������� <������� � ���������������� FLASH ������>, ����������� � IROM (Internal ROM) ����������.
//  �����, ������� ���������, ��� �� ����������� ��������� �������, ����������������� ��� Custom BootLoader... ���, � STM32F103VE ��� ����� �������� <� ����� ������> - ������� �� �������.

// ����������: ��������� �� ���� FLASH, ������� ��������� ������� ������ ������ ����������� (���� ��� ������������ ��� ������ �����)
#define EEPROM_INDENT_PAGES_FROM_END      64

// EEPROM emulation start address in Flash: last 2 pages of available Flash memory (�������� ����������������� �������� ������ ������).
#ifdef FLASH_BANK2_END
  // ������: ���������������� STM32 XL-����� (� ������� ����� 512K FLASH) ����� ��� ����� ������ - ������� ���������.
  #define EEPROM_START_ADDRESS    (FLASH_BANK2_END - 2*PAGE_SIZE - EEPROM_INDENT_PAGES_FROM_END*PAGE_SIZE + 1) 
#else
  #define EEPROM_START_ADDRESS    (FLASH_BANK1_END - 2*PAGE_SIZE - EEPROM_INDENT_PAGES_FROM_END*PAGE_SIZE + 1) 
#endif


//-----------------------------------------------------------------------------
// �����-�� ������� ��� ���������� (�������� �� AN2594)

// Pages 0 and 1 base and end addresses 
#define PAGE0_BASE_ADDRESS      ((uint32_t)(EEPROM_START_ADDRESS + 0x0000))
#define PAGE0_END_ADDRESS       ((uint32_t)(EEPROM_START_ADDRESS + (PAGE_SIZE - 1)))

#define PAGE1_BASE_ADDRESS      ((uint32_t)(EEPROM_START_ADDRESS + PAGE_SIZE))
#define PAGE1_END_ADDRESS       ((uint32_t)(EEPROM_START_ADDRESS + (2 * PAGE_SIZE - 1)))

// Used Flash pages for EEPROM emulation
#define PAGE0                   ((uint16_t)0x0000)
#define PAGE1                   ((uint16_t)0x0001)

// No valid page define
#define NO_VALID_PAGE           ((uint16_t)0x00AB)

// Page status definitions
#define ERASED                  ((uint16_t)0xFFFF)     /* PAGE is empty */
#define RECEIVE_DATA            ((uint16_t)0xEEEE)     /* PAGE is marked to receive data */
#define VALID_PAGE              ((uint16_t)0x0000)     /* PAGE containing valid data */

// Valid pages in read and write defines
#define READ_FROM_VALID_PAGE    ((uint8_t)0x00)
#define WRITE_IN_VALID_PAGE     ((uint8_t)0x01)

// Page full define
#define PAGE_FULL               ((uint8_t)0x80)

// Flash Control Register bits
#define CR_PG_Set                ((uint32_t)0x00000001)
#define CR_PG_Reset              ((uint32_t)0x00001FFE) 
#define CR_PER_Set               ((uint32_t)0x00000002)
#define CR_PER_Reset             ((uint32_t)0x00001FFD)
#define CR_MER_Set               ((uint32_t)0x00000004)
#define CR_MER_Reset             ((uint32_t)0x00001FFB)
#define CR_OPTPG_Set             ((uint32_t)0x00000010)
#define CR_OPTPG_Reset           ((uint32_t)0x00001FEF)
#define CR_OPTER_Set             ((uint32_t)0x00000020)
#define CR_OPTER_Reset           ((uint32_t)0x00001FDF)
#define CR_STRT_Set              ((uint32_t)0x00000040)
#define CR_LOCK_Set              ((uint32_t)0x00000080)

// Delay definition
#define EraseTimeout          ((uint32_t)0x000B0000)
#define ProgramTimeout        ((uint32_t)0x00002000)

// Exported macro
#define IS_FLASH_ADDRESS(ADDRESS) (((ADDRESS) >= 0x08000000) && ((ADDRESS) < 0x080FFFFF))



//============================================================================
// ���������� ���������� �������
//============================================================================
// COPYRIGHT 2009 STMicroelectronics


//---------------------------------------------------------------------------
// Forward declarations for private functions:

